# Brewfile: CLI & GUI packages

tap "homebrew/core"

brew "git"
brew "awscli"
brew "python@3.12"
brew "node"
brew "openjdk@17"
brew "maven"
brew "fzf"
brew "docker"
brew "kubectl"
brew "jenv"
brew "pyenv"
brew "tfenv"
brew "nvm"

cask "iterm2"
cask "google-chrome"
cask "pycharm"
cask "intellij-idea"
cask "sublime-text"
cask "docker"
cask "visual-studio-code"
cask "font-meslo-lg-nerd-font"

# mas "Xcode", id: 497799835