# Brewfile — CLI & GUI packages

brew "git"
brew "awscli"             # needs python@3.12
brew "python@3.12"
brew "node"
brew "openjdk@17"
brew "maven"
brew "fzf"
brew "yarn"              # ← Yarn package manager
brew "docker"            # Docker CLI (Colima provides the daemon)
brew "docker-compose"
brew "colima" 
brew "kubernetes-cli"
brew "jenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"
brew "tfenv"
brew "nvm"
brew "autojump"
brew "tig"
brew "TomAnthony/brews/itermocil"
brew "htop"
brew "cloudflared"

cask "iterm2"
cask "chatgpt"
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "pycharm"
cask "intellij-idea"
cask "sublime-text"
cask "microsoft-teams"
cask "zoom"
cask "visual-studio-code"
cask "font-meslo-lg-nerd-font"
cask "windows-app"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "maccy"
cask "omnifocus"
cask "ollama"
cask "todoist"

# mas "Xcode", id: 497799835